---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.GutterType
source: html/20640def-f0d0-c957-c43c-c43ccee90fc4.htm
---
# GutterType Properties

The id of the assembly instance to which the element belongs.